cfe/src/InformationRegisters/ИИ_ИсторияЧатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ИИ_ИсторияЧатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИИ_РолиСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИИ_СессииЧатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe/src/Enums/ИИ_РолиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ИИ_РолиСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ассистент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe/src/InformationRegisters/ИИ_ИсторияЧатов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Возвращает историю сообщений сессии.
//
// Параметры:
//  Сессия - СправочникСсылка.ИИ_СессииЧатов - сессия чата.
//
// Возвращаемое значение:
//  ТаблицаЗначений - история сообщений с колонками Роль, ТекстСообщения, ИдентификаторСообщения, ДатаСообщения.
//
Функция ИсторияСессии(Знач Сессия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|   ИИ_ИсторияЧатов.Роль КАК Роль,
		|   ИИ_ИсторияЧатов.ТекстСообщения КАК ТекстСообщения,
		|   ИИ_ИсторияЧатов.ИдентификаторСообщения КАК ИдентификаторСообщения,
		|   ИИ_ИсторияЧатов.ДатаСообщения КАК ДатаСообщения
		|ИЗ
		|   РегистрСведений.ИИ_ИсторияЧатов КАК ИИ_ИсторияЧатов
		|ГДЕ
		|   ИИ_ИсторияЧатов.Сессия = &Сессия
		|
		|УПОРЯДОЧИТЬ ПО
		|   ДатаСообщения,
		|   ИдентификаторСообщения";
	
	Запрос.УстановитьПараметр("Сессия", Сессия);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Добавляет сообщение в историю чата.
//
// Параметры:
//  Сессия - СправочникСсылка.ИИ_СессииЧатов - сессия чата.
//  Роль - ПеречислениеСсылка.ИИ_РолиСообщений - роль сообщения.
//  ТекстСообщения - Строка - текст сообщения.
//  ДатаСообщения - Дата - дата и время сообщения (по умолчанию текущая дата сеанса).
//
Процедура ДобавитьСообщение(Знач Сессия, Знач Роль, Знач ТекстСообщения, Знач ДатаСообщения = Неопределено) Экспорт
	
	Если ДатаСообщения = Неопределено Тогда
		ДатаСообщения = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.Сессия = Сессия;
	Запись.ИдентификаторСообщения = НовыйИдентификаторСообщения();
	Запись.Роль = Роль;
	Запись.ТекстСообщения = ТекстСообщения;
	Запись.ДатаСообщения = ДатаСообщения;
	Запись.Записать();
	
КонецПроцедуры

// Проверяет, есть ли сообщения в сессии.
//
// Параметры:
//  Сессия - СправочникСсылка.ИИ_СессииЧатов - сессия чата.
//
// Возвращаемое значение:
//  Булево - Истина, если в сессии есть сообщения.
//
Функция ЕстьСообщенияВСессии(Знач Сессия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|   ИСТИНА КАК ЕстьСообщения
		|ИЗ
		|   РегистрСведений.ИИ_ИсторияЧатов КАК ИИ_ИсторияЧатов
		|ГДЕ
		|   ИИ_ИсторияЧатов.Сессия = &Сессия";
	
	Запрос.УстановитьПараметр("Сессия", Сессия);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Проверяет, есть ли в сессии сообщение пользователя с указанным текстом.
//
// Параметры:
//  Сессия - СправочникСсылка.ИИ_СессииЧатов - сессия чата.
//  ТекстСообщения - Строка - текст сообщения.
//
// Возвращаемое значение:
//  Булево - Истина, если сообщение найдено.
//
Функция ЕстьСообщениеПользователя(Знач Сессия, Знач ТекстСообщения) Экспорт
	
	МаксимальнаяДлинаДляСравнения = 1024;
	ТекстДляПоиска = Лев(ТекстСообщения, МаксимальнаяДлинаДляСравнения);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|   1 КАК Флаг
		|ИЗ
		|   РегистрСведений.ИИ_ИсторияЧатов КАК ИИ_ИсторияЧатов
		|ГДЕ
		|   ИИ_ИсторияЧатов.Сессия = &Сессия
		|   И ИИ_ИсторияЧатов.Роль = &РольПользователь
		|   И ВЫРАЗИТЬ(ИИ_ИсторияЧатов.ТекстСообщения КАК СТРОКА(1024)) = &ТекстСообщения";
	
	Запрос.УстановитьПараметр("Сессия", Сессия);
	Запрос.УстановитьПараметр("РольПользователь", Перечисления.ИИ_РолиСообщений.Пользователь);
	Запрос.УстановитьПараметр("ТекстСообщения", ТекстДляПоиска);
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

// Проверяет, является ли текущее сообщение первым сообщением пользователя в сессии.
//
// Параметры:
//  Сессия - СправочникСсылка.ИИ_СессииЧатов - сессия чата.
//
// Возвращаемое значение:
//  Булево - Истина, если в сессии ровно одно сообщение пользователя.
//
Функция ЭтоПервоеСообщениеПользователя(Знач Сессия) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|   КОЛИЧЕСТВО(*) КАК Количество
		|ИЗ
		|   РегистрСведений.ИИ_ИсторияЧатов КАК ИИ_ИсторияЧатов
		|ГДЕ
		|   ИИ_ИсторияЧатов.Сессия = &Сессия
		|   И ИИ_ИсторияЧатов.Роль = &РольПользователь";
	
	Запрос.УстановитьПараметр("Сессия", Сессия);
	Запрос.УстановитьПараметр("РольПользователь", Перечисления.ИИ_РолиСообщений.Пользователь);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Количество = 1;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

// Возвращает текст сообщения по идентификатору.
//
// Параметры:
//  Сессия - СправочникСсылка.ИИ_СессииЧатов - сессия чата.
//  Идентификатор - Строка - идентификатор сообщения.
//
// Возвращаемое значение:
//  Строка - текст сообщения или пустая строка, если не найдено.
//
Функция ТекстСообщенияПоИдентификатору(Знач Сессия, Знач Идентификатор) Экспорт
	
	Если Не ЗначениеЗаполнено(Сессия) Тогда
		Возврат "";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|   ИИ_ИсторияЧатов.ТекстСообщения КАК ТекстСообщения
		|ИЗ
		|   РегистрСведений.ИИ_ИсторияЧатов КАК ИИ_ИсторияЧатов
		|ГДЕ
		|   ИИ_ИсторияЧатов.Сессия = &Сессия
		|   И ИИ_ИсторияЧатов.ИдентификаторСообщения = &ИдентификаторСообщения";
	
	Запрос.УстановитьПараметр("Сессия", Сессия);
	Запрос.УстановитьПараметр("ИдентификаторСообщения", Идентификатор);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.ТекстСообщения;
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Удаляет всю историю сообщений сессии.
//
// Параметры:
//  Сессия - СправочникСсылка.ИИ_СессииЧатов - сессия чата.
//
Процедура УдалитьИсториюСессии(Знач Сессия) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сессия.Установить(Сессия);
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйИдентификаторСообщения()
	
	Возврат СтрЗаменить(Новый УникальныйИдентификатор(ВерсияУникальногоИдентификатора.Версия1), "-", "");
	
КонецФункции

#КонецОбласти
